In [3]:
import os 
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
csv_path_ride_data = os.path.join('raw_data','ride_data.csv')
csv_path_city_data = os.path.join('raw_data','city_data.csv')

In [31]:
rides_df = pd.read_csv(csv_path_ride_data)
cities_df = pd.read_csv(csv_path_city_data)

In [33]:
# check for number of rows
rides_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [34]:
# drop the empty rows and then do a count
rides_df = rides_df.dropna(how='any')

rides_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [35]:
# check for repeating cities
print("Length of Value Counts: {}".format(len(rides_df['city'].value_counts())))
print('Length of Unique Cities: {}'.format(len(rides_df['city'].unique())))

Length of Value Counts: 125
Length of Unique Cities: 125

In [36]:
# check for number of rows
cities_df.count()

city            126
driver_count    126
type            126
dtype: int64

In [37]:
# drop the empty rows and then do a count
cities_df = cities_df.dropna(how='any')

cities_df.count()

city            126
driver_count    126
type            126
dtype: int64

In [38]:
# check for repeat cities
print("Length of Value Counts: {}".format(len(cities_df['city'].value_counts())))
print('Length of Unique Cities: {}'.format(len(cities_df['city'].unique())))

Length of Value Counts: 125
Length of Unique Cities: 125

In [41]:
# display
cities_df.head()

             city  driver_count   type
0      Kelseyland            63  Urban
1      Nguyenbury             8  Urban
2    East Douglas            12  Urban
3   West Dawnfurt            34  Urban
4  Rodriguezburgh            52  Urban

In [74]:
# display
rides_df.head()

          city                 date   fare        ride_id
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673

In [77]:
uber_df = pd.merge(rides_df,cities_df,on='city')
uber_df.head()

       city                 date   fare        ride_id  driver_count   type
0  Sarabury  2016-01-16 13:49:27  38.35  5403689035038            46  Urban
1  Sarabury  2016-07-23 07:42:44  21.76  7546681945283            46  Urban
2  Sarabury  2016-04-02 04:32:25  38.03  4932495851866            46  Urban
3  Sarabury  2016-06-23 05:03:41  26.82  6711035373406            46  Urban
4  Sarabury  2016-09-30 12:48:34  30.30  6388737278232            46  Urban